content.org/2021.org
#+hugo_base_dir: /home/plovs/Projects/QWxleA.github.io
#+category: blog

** DONE Android Apps -- 2021                                           :android:
   CLOSED: [2021-01-22 Fri 23:48]
   :PROPERTIES:
   :EXPORT_FILE_NAME: android-apps-2021
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :description
   :EXPORT_HUGO_AUTO_SET_LASTMOD: t
   :END:

   Now that we're at home a lot, it's time to clean up my phone. Over time I've fallen into some bad habits, and it's time to clean up my act.

   | Category                      | Currently using                        | Better alternative                          |
   |-------------------------------+----------------------------------------+---------------------------------------------|
   | [[*Ad blocker][Ad Blocker]]                    | [[https://blokada.org/][blokada.org]]                            | -                                           |
   | [[App store][App Store]]                     | Google App store                       | [[https://f-droid.org/][F-Droid]]                                     |
   | [[*Audio / Video conferencing][Audio / Video conferencing]]    | Zoom                                   | -                                           |
   | [[Contacts, AddressBook and Reminders][Contacts and AddressBook sync]] | Google addressbook                     | [[https://f-droid.org/en/packages/at.bitfire.davdroid/][DAVx⁵ - F-Droid]]                             |
   | [[*Ebooks][Ebooks]]                        | [[http://moondownload.com/][Moon+ Reader for Android]]               | ?                                           |
   | [[*Exercise][Exercise]]                      |                                        | [[https://gitlab.com/enjoyingfoss/feeel/-/wikis/home][Feeel - GitLab]]  [[https://f-droid.org/en/packages/de.dennisguse.opentracks/][OpenTracks]]                  |
   | [[*File synchronisation][File Synchronization]]          |                                        | [[https://syncthing.net/][Syncthing]]                                   |
   | [[*Habit forming][Habit forming]]                 |                                        | [[https://f-droid.org/en/packages/org.isoron.uhabits/][Loop Habit Tracker]]                          |
   | [[*Keyboard][Keyboard]]                      |                                        | [[https://anysoftkeyboard.github.io/][AnySoftKeyboard]]                             |
   | [[Messaging][Messaging]]                     | WhatsApp                               | [[https://github.com/vector-im/element-android][vector-im/element-android]]                   |
   | [[*Maps][Maps]]                          | Google Maps                            | [[https://osmand.net/][OsmAnd - Offline Mobile Maps and Navigation]] |
   | [[*Music][Music]]                         | [[https://neutroncode.com/apps/player][Neutron Music Player]]                   |                                             |
   | [[*Online Radio][Online Radio]]                  | [[https://f-droid.org/en/packages/net.programmierecke.radiodroid2/][RadioDroid]]                             |                                             |
   | [[*Password manager][Password Manager]]              | [[https://bitwarden.com/][Bitwarden Open Source Password Manager]] | [[http://www.keepassdroid.com/][KeePassDroid]]                                |
   | [[*Podcasts][Podcasts]]                      | [[https://www.pocketcasts.com/][Pocket Casts]]                           | [[https://antennapod.org/][AntennaPod]]                                  |
   | [[ App store][Proprietary app store]]         |                                        | [[https://f-droid.org/en/packages/com.github.yeriomin.yalpstore/][Yalp Store]]                                  |
   | [[Contacts, AddressBook and Reminders][Reminders]]                     |                                        | [[https://f-droid.org/en/packages/org.tasks/][Tasks.org]]                                   |
   | [[*RSS][RSS]]                           |                                        | [[https://f-droid.org/en/packages/com.nononsenseapps.feeder/][Feeder]] [[https://www.f-droid.org/en/packages/org.fox.tttrss/][Tiny Tiny RSS]]                        |
   | [[*Social Media][Social Media]]                  | Twitter, [[https://tusky.app/][Tusky]], [[https://github.com/fwgs/husky][Husky]]                  |                                             |
   | [[*Spaced repetition][Spaced repetition]]             | [[https://f-droid.org/en/packages/com.ichi2.anki/][AnkiDroid]]                              |                                             |
   | [[*Web Browsers][Web Browsers]]                  | Firefox Beta, Chrome, [[https://www.torproject.org/download/][tor browser]]      | [[https://f-droid.org/en/packages/org.mozilla.klar/][Firefox Klar]]                                |
   | [[Wine - the liquid version, not the Windows not-emulator][Wine]]                          | [[https://www.vivino.com/][Vivino]]                                 |                                             |
   | [[*YouTube Music and SoundCloud][YouTube Music and SoundCloud]]  | [[https://newpipe.net/][NewPipe]]                                |                                             |
*** Ad blocker

    It is impossible to use the web nowadays without a half decent ad-blocker. The first line of defense should be your DNS, so blocking some 40k sites at the DNS level clears up a lot of trash. Blokada is really good, I only notice how good using somebody elses Internet connction.

    Afaik this is a good and secure app: [[https://blokada.org/][blokada.org]] (doesn't need root)
*** App store
    This one is tricky. Some apps that I need cannot be downloaded from F-Droid. Sideloading sounds shady, how can I trust this third party site?

    I have both installed, but do my best to download more from [[https://f-droid.org/][F-Droid - Free and Open Source Android App Repository]].

    This seems interesting, and I plan to test it on my rooted old phone: [[https://f-droid.org/en/packages/com.github.yeriomin.yalpstore/][Yalp Store | F-Droid - Free and Open Source Android App Repository]]

    *Description:* Yalp Store lets you download apps '''directly''' from Google Play Store '''as
    apk files'''. It can search for '''updates''' of installed apps and lets you
    '''search''' for other apps. Yalp saves downloaded apks to your default download
    folder. Other features include browsing categories, viewing and leaving reviews,
    black/whitelisting apps for updates, filtering apps by being free/paid and
    containing/not containing ads.

*** Audio / Video conferencing

    Zoom is terrible. It is also what everybody in my surroundings use. For now no possible alternatives.
*** Contacts, AddressBook and Reminders

    Android phones have a linked google account, which has a linked address book. It is probably one of the worst things to give to Google, but ... it's very convenient. [[https://f-droid.org/en/packages/at.bitfire.davdroid/][DAVx⁵ - F-Droid]] looks like a nice(r) alternative, but I would have to setup a way to sync my data.

    Tasks can be used entirely offline, or synchronized with Google Tasks, CalDAV, or EteSync. It might be a good combo with DAVx5.
*** Ebooks
    [[http://moondownload.com/][Moon+ Reader for Android]], I really like this app, I bought it a long time ago, and use it regularly. Don't really know any alternatives, but haven't really looked.
*** Exercise
    Looked into this, and a lot of apps on the play store look really shady. [[https://gitlab.com/enjoyingfoss/feeel/-/wikis/home][Feeel - GitLab]] looks really nice, but so far I have been to lazy to really use it. I thought it interesting that the author asked for photos as a way to contribute.

    Also: [[https://f-droid.org/en/packages/de.dennisguse.opentracks/][OpenTracks]]
*** File synchronisation
    [[https://syncthing.net/][Syncthing]] is a famous app, I have tried it several times, but I have never been able to get it to work right. There was always something. Maybe because I only use mobile internet, so everything is connected to my phone, and that messes up the syncing? No idea, but I should really get this working, one day.
*** Habit forming
    [[https://f-droid.org/en/packages/org.isoron.uhabits/][Loop Habit Tracker]] is a simple app that helps you create and maintain good habits, allowing
    you to achieve your long-term goals. Detailed graphs and statistics show you how
    your habits improved over time. I mostly use Emacs, but this app looks really nice.
*** Keyboard

     [[https://anysoftkeyboard.github.io/][AnySoftKeyboard]] -- gestures, dark-mode and multiple languages, and doesn't spy on you. This is just a good app. Installed it not long ago, but have no complaints, so far.
*** Maps
    [[https://osmand.net/][OsmAnd]] is a great app, the offline support is perfect (as in really nice), but Google Maps is better. I should not be using it, but so far it is hard to break the habit. Installed OsmanA (again), and will do my best.
*** Messaging
    Not really a fan of messaging in general, and everybody I know uses WhatsApp, which doesn't help. Element, a Matrix client seems to be a much better alternative:Android, [[https://github.com/vector-im/element-android][vector-im/element-android]] and desktop, [[https://github.com/vector-im/element-web][vector-im/element-web]]
*** Music
     [[https://neutroncode.com/apps/player][Neutron Music Player]] is imho the best music player on Android. I bought it quite a while ago and don't intend to exchange it for something else. I didn't study it as far as security is concerned, but the developer is a hardcore audio nerd and it's hard to imagine him adding spyware to his pride and joy.
*** Online Radio
     [[https://f-droid.org/en/packages/net.programmierecke.radiodroid2/][RadioDroid]] is a new app for me, the app also supports the [[https://wiki.archlinux.org/index.php/Music_Player_Daemon][Music Player Daemon - ArchWiki]]. So far I really don't listen to the radio all that much. The app is ok.
*** Password manager
    Probaly the most important part of your personal digital security. I'm satisfied with [[https://bitwarden.com/][Bitwarden]], although I use their server, which is not the optimal solution. A better / more secure solution would be [[http://www.keepassdroid.com/][KeePassDroid]], combined with something from [[https://wiki.archlinux.org/index.php/KeePass][KeePass - ArchWiki]], but Bitwarden is very easy / convenient.
*** Podcasts

    This is another hard one. I have been using [[https://www.pocketcasts.com/][Pocket Casts]] for years, bought it actually, and it is a very nice and convenient app. [[https://antennapod.org/][AntennaPod]] is the best free and open app, it is quite good, just not as streamlined as Pocket Casts. I'll keep what I have for now, but it's good to know a good enough second option exists.
*** RSS
    I don't really use RSS on my phone, I use [[https://newsboat.org/][Newsboat]] on my desktop, and if you can't sync then it's just annoying. [[https://f-droid.org/en/packages/com.nononsenseapps.feeder/][Feeder]] looks like a good app, but as I mostly work from home it is not that relevant at the moment. [[https://www.f-droid.org/en/packages/org.fox.tttrss/][Tiny Tiny RSS]] would be a good idea if I ever get TTR installed on a publicly accessible server.
*** Social Media
    This one (should be) easy. Twitter bad, Mastodon good. I use  [[https://tusky.app/][Tusky]] often, but am playing with [[https://github.com/fwgs/husky][Husky]]. Let the best win! I like that it is possible to use both.
*** Spaced repetition
    Anki exists both on the desktop ([[https://apps.ankiweb.net/][Anki - powerful, intelligent flashcards]]), and on Android, [[https://f-droid.org/en/packages/com.ichi2.anki/][AnkiDroid]]. The server is closed source, but it's possible to run your own server with [[https://github.com/ankicommunity/anki-sync-server][anki-sync-server: A personal Anki sync server]]. See also: [[*Spaced repetition -- Learning with Emacs and Anki][Spaced repetition Learning with Emacs]].
*** Web Browsers
    This is a big one. Firefox has been very good for a while, so there really is no reason not to use it. Unfortunetely on the desktop, Chromium is better/easier for web-devel, and I slowly started using that. But Google has been helpful, [[https://www.zdnet.com/article/google-cuts-off-other-chromium-based-browsers-from-its-sync-service/][promising to cut off Chromium]], so that's a good reminder not to put our trust in our multi-alphabetical overlords.

    Firefox (beta) with sync is very convenient, it is possible to host a sync server as well:

    - [[https://wiki.archlinux.org/index.php/Firefox_Sync_Server][Firefox Sync Server - ArchWiki]]
    - [[https://github.com/mozilla-services/syncserver][mozilla-services/syncserver: Run-Your-Own Firefox Sync Server]]

    The [[https://www.torproject.org/download/][tor browser]] is a good browser as well, I just don't have a good use-case for it. I use it more for fun then anything.

    [[https://f-droid.org/en/packages/org.mozilla.klar/][Firefox Klar]], installed it (again), and put it on my front-page. Let's see if I can use it more. It *is* that you can lock the app with a fingerprint. Absolutely no extra work, and one extra step insecurity.

*** Wine - the liquid version, not the Windows not-emulator

    Closed source, and they send annoying email, but the app is very good, and the recommendations tasty: [[https://www.vivino.com/][Vivino.com - Buy the Right Wine]]. No alternatives afaik.

*** YouTube Music and SoundCloud

    This one is easy, nothing beats [[https://newpipe.net/][NewPipe - a free YouTube client]]. The UI is a little bit clunckier then the YouTube app, but it lacks adds, and even more important, you can listen to music with your screen locked, eg, with your phone in your pocket, which is kind of the point of a mobile phone.

    This app is the best app for Youtube, bar none. The only downside is that sometimes Google does something shady, and the app stops working. Then it's time to update. Not a big deal, but still, annoying.
*** links

  - https://njoseph.me/mediawiki/Privacy_Stack
  - [[https://garykim.dev/blog/2020/04/14/personal-f-droid-repository/][Personal F-Droid Repository • Gary Kim: Website]]

