content/posts/android-apps-2021.md
+++
title = "Android Apps – 2021"
author = ["Alex Qwxlea"]
date = 2021-01-22T23:48:00+02:00
lastmod = 2021-01-23T12:24:54+02:00
tags = ["android"]
draft = false
+++

Now that we're at home a lot, it's time to clean up my phone. Over time I've fallen into some bad habits, and it's time to clean up my act.

| Category                                                             | Currently using                                                                | Better alternative                                                                                                                            |
|----------------------------------------------------------------------|--------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------|
| [Ad Blocker](#ad-blocker)                                            | [blokada.org](https://blokada.org/)                                            | -                                                                                                                                             |
| [App Store](#app-store)                                              | Google App store                                                               | [F-Droid](https://f-droid.org/)                                                                                                               |
| [Audio / Video conferencing](#audio-video-conferencing)              | Zoom                                                                           | -                                                                                                                                             |
| [Contacts and AddressBook sync](#contacts-addressbook-and-reminders) | Google addressbook                                                             | [DAVx⁵ - F-Droid](https://f-droid.org/en/packages/at.bitfire.davdroid/)                                                                       |
| [Ebooks](#ebooks)                                                    | [Moon+ Reader for Android](http://moondownload.com/)                           | ?                                                                                                                                             |
| [Exercise](#exercise)                                                |                                                                                | [Feeel - GitLab](https://gitlab.com/enjoyingfoss/feeel/-/wikis/home)  [OpenTracks](https://f-droid.org/en/packages/de.dennisguse.opentracks/) |
| [File Synchronization](#file-synchronisation)                        |                                                                                | [Syncthing](https://syncthing.net/)                                                                                                           |
| [Habit forming](#habit-forming)                                      |                                                                                | [Loop Habit Tracker](https://f-droid.org/en/packages/org.isoron.uhabits/)                                                                     |
| [Keyboard](#keyboard)                                                |                                                                                | [AnySoftKeyboard](https://anysoftkeyboard.github.io/)                                                                                         |
| [Messaging](#messaging)                                              | WhatsApp                                                                       | [vector-im/element-android](https://github.com/vector-im/element-android)                                                                     |
| [Maps](#maps)                                                        | Google Maps                                                                    | [OsmAnd - Offline Mobile Maps and Navigation](https://osmand.net/)                                                                            |
| [Music](#music)                                                      | [Neutron Music Player](https://neutroncode.com/apps/player)                    |                                                                                                                                               |
| [Online Radio](#online-radio)                                        | [RadioDroid](https://f-droid.org/en/packages/net.programmierecke.radiodroid2/) |                                                                                                                                               |
| [Password Manager](#password-manager)                                | [Bitwarden Open Source Password Manager](https://bitwarden.com/)               | [KeePassDroid](http://www.keepassdroid.com/)                                                                                                  |
| [Podcasts](#podcasts)                                                | [Pocket Casts](https://www.pocketcasts.com/)                                   | [AntennaPod](https://antennapod.org/)                                                                                                         |
| [Proprietary app store](#app-store)                                  |                                                                                | [Yalp Store](https://f-droid.org/en/packages/com.github.yeriomin.yalpstore/)                                                                  |
| [Reminders](#contacts-addressbook-and-reminders)                     |                                                                                | [Tasks.org](https://f-droid.org/en/packages/org.tasks/)                                                                                       |
| [RSS](#rss)                                                          |                                                                                | [Feeder](https://f-droid.org/en/packages/com.nononsenseapps.feeder/) [Tiny Tiny RSS](https://www.f-droid.org/en/packages/org.fox.tttrss/)     |
| [Social Media](#social-media)                                        | Twitter, [Tusky](https://tusky.app/), [Husky](https://github.com/fwgs/husky)   |                                                                                                                                               |
| [Spaced repetition](#spaced-repetition)                              | [AnkiDroid](https://f-droid.org/en/packages/com.ichi2.anki/)                   |                                                                                                                                               |
| [Web Browsers](#web-browsers)                                        | Firefox Beta, Chrome, [tor browser](https://www.torproject.org/download/)      | [Firefox Klar](https://f-droid.org/en/packages/org.mozilla.klar/)                                                                             |
| [Wine](#wine-the-liquid-version-not-the-windows-not-emulator)        | [Vivino](https://www.vivino.com/)                                              |                                                                                                                                               |
| [YouTube Music and SoundCloud](#youtube-music-and-soundcloud)        | [NewPipe](https://newpipe.net/)                                                |                                                                                                                                               |


## Ad blocker {#ad-blocker}

It is impossible to use the web nowadays without a half decent ad-blocker. The first line of defense should be your DNS, so blocking some 40k sites at the DNS level clears up a lot of trash. Blokada is really good, I only notice how good using somebody elses Internet connction.

Afaik this is a good and secure app: [blokada.org](https://blokada.org/) (doesn't need root)


## App store {#app-store}

This one is tricky. Some apps that I need cannot be downloaded from F-Droid. Sideloading sounds shady, how can I trust this third party site?

I have both installed, but do my best to download more from [F-Droid - Free and Open Source Android App Repository](https://f-droid.org/).

This seems interesting, and I plan to test it on my rooted old phone: [Yalp Store | F-Droid - Free and Open Source Android App Repository](https://f-droid.org/en/packages/com.github.yeriomin.yalpstore/)

**Description:** Yalp Store lets you download apps '''directly''' from Google Play Store '''as
apk files'''. It can search for '''updates''' of installed apps and lets you
'''search''' for other apps. Yalp saves downloaded apks to your default download
folder. Other features include browsing categories, viewing and leaving reviews,
black/whitelisting apps for updates, filtering apps by being free/paid and
containing/not containing ads.


## Audio / Video conferencing {#audio-video-conferencing}

Zoom is terrible. It is also what everybody in my surroundings use. For now no possible alternatives.


## Contacts, AddressBook and Reminders {#contacts-addressbook-and-reminders}

Android phones have a linked google account, which has a linked address book. It is probably one of the worst things to give to Google, but ... it's very convenient. [DAVx⁵ - F-Droid](https://f-droid.org/en/packages/at.bitfire.davdroid/) looks like a nice(r) alternative, but I would have to setup a way to sync my data.

Tasks can be used entirely offline, or synchronized with Google Tasks, CalDAV, or EteSync. It might be a good combo with DAVx5.


## Ebooks {#ebooks}

[Moon+ Reader for Android](http://moondownload.com/), I really like this app, I bought it a long time ago, and use it regularly. Don't really know any alternatives, but haven't really looked.


## Exercise {#exercise}

Looked into this, and a lot of apps on the play store look really shady. [Feeel - GitLab](https://gitlab.com/enjoyingfoss/feeel/-/wikis/home) looks really nice, but so far I have been to lazy to really use it. I thought it interesting that the author asked for photos as a way to contribute.

Also: [OpenTracks](https://f-droid.org/en/packages/de.dennisguse.opentracks/)


## File synchronisation {#file-synchronisation}

[Syncthing](https://syncthing.net/) is a famous app, I have tried it several times, but I have never been able to get it to work right. There was always something. Maybe because I only use mobile internet, so everything is connected to my phone, and that messes up the syncing? No idea, but I should really get this working, one day.


## Habit forming {#habit-forming}

[Loop Habit Tracker](https://f-droid.org/en/packages/org.isoron.uhabits/) is a simple app that helps you create and maintain good habits, allowing
you to achieve your long-term goals. Detailed graphs and statistics show you how
your habits improved over time. I mostly use Emacs, but this app looks really nice.


## Keyboard {#keyboard}

[AnySoftKeyboard](https://anysoftkeyboard.github.io/) -- gestures, dark-mode and multiple languages, and doesn't spy on you. This is just a good app. Installed it not long ago, but have no complaints, so far.


## Maps {#maps}

[OsmAnd](https://osmand.net/) is a great app, the offline support is perfect (as in really nice), but Google Maps is better. I should not be using it, but so far it is hard to break the habit. Installed OsmanA (again), and will do my best.


## Messaging {#messaging}

Not really a fan of messaging in general, and everybody I know uses WhatsApp, which doesn't help. Element, a Matrix client seems to be a much better alternative:Android, [vector-im/element-android](https://github.com/vector-im/element-android) and desktop, [vector-im/element-web](https://github.com/vector-im/element-web)


## Music {#music}

[Neutron Music Player](https://neutroncode.com/apps/player) is imho the best music player on Android. I bought it quite a while ago and don't intend to exchange it for something else. I didn't study it as far as security is concerned, but the developer is a hardcore audio nerd and it's hard to imagine him adding spyware to his pride and joy.


## Online Radio {#online-radio}

[RadioDroid](https://f-droid.org/en/packages/net.programmierecke.radiodroid2/) is a new app for me, the app also supports the [Music Player Daemon - ArchWiki](https://wiki.archlinux.org/index.php/Music%5FPlayer%5FDaemon). So far I really don't listen to the radio all that much. The app is ok.


## Password manager {#password-manager}

Probaly the most important part of your personal digital security. I'm satisfied with [Bitwarden](https://bitwarden.com/), although I use their server, which is not the optimal solution. A better / more secure solution would be [KeePassDroid](http://www.keepassdroid.com/), combined with something from [KeePass - ArchWiki](https://wiki.archlinux.org/index.php/KeePass), but Bitwarden is very easy / convenient.


## Podcasts {#podcasts}

This is another hard one. I have been using [Pocket Casts](https://www.pocketcasts.com/) for years, bought it actually, and it is a very nice and convenient app. [AntennaPod](https://antennapod.org/) is the best free and open app, it is quite good, just not as streamlined as Pocket Casts. I'll keep what I have for now, but it's good to know a good enough second option exists.


## RSS {#rss}

I don't really use RSS on my phone, I use [Newsboat](https://newsboat.org/) on my desktop, and if you can't sync then it's just annoying. [Feeder](https://f-droid.org/en/packages/com.nononsenseapps.feeder/) looks like a good app, but as I mostly work from home it is not that relevant at the moment. [Tiny Tiny RSS](https://www.f-droid.org/en/packages/org.fox.tttrss/) would be a good idea if I ever get TTR installed on a publicly accessible server.


## Social Media {#social-media}

This one (should be) easy. Twitter bad, Mastodon good. I use  [Tusky](https://tusky.app/) often, but am playing with [Husky](https://github.com/fwgs/husky). Let the best win! I like that it is possible to use both.


## Spaced repetition {#spaced-repetition}

Anki exists both on the desktop ([Anki - powerful, intelligent flashcards](https://apps.ankiweb.net/)), and on Android, [AnkiDroid](https://f-droid.org/en/packages/com.ichi2.anki/). The server is closed source, but it's possible to run your own server with [anki-sync-server: A personal Anki sync server](https://github.com/ankicommunity/anki-sync-server). See also: [Spaced repetition Learning with Emacs]({{< relref "spaced-repetition-learning-with-emacs" >}}).


## Web Browsers {#web-browsers}

This is a big one. Firefox has been very good for a while, so there really is no reason not to use it. Unfortunetely on the desktop, Chromium is better/easier for web-devel, and I slowly started using that. But Google has been helpful, [promising to cut off Chromium](https://www.zdnet.com/article/google-cuts-off-other-chromium-based-browsers-from-its-sync-service/), so that's a good reminder not to put our trust in our multi-alphabetical overlords.

Firefox (beta) with sync is very convenient, it is possible to host a sync server as well:

-   [Firefox Sync Server - ArchWiki](https://wiki.archlinux.org/index.php/Firefox%5FSync%5FServer)
-   [mozilla-services/syncserver: Run-Your-Own Firefox Sync Server](https://github.com/mozilla-services/syncserver)

The [tor browser](https://www.torproject.org/download/) is a good browser as well, I just don't have a good use-case for it. I use it more for fun then anything.

[Firefox Klar](https://f-droid.org/en/packages/org.mozilla.klar/), installed it (again), and put it on my front-page. Let's see if I can use it more. It **is** that you can lock the app with a fingerprint. Absolutely no extra work, and one extra step insecurity.


## Wine - the liquid version, not the Windows not-emulator {#wine-the-liquid-version-not-the-windows-not-emulator}

Closed source, and they send annoying email, but the app is very good, and the recommendations tasty: [Vivino.com - Buy the Right Wine](https://www.vivino.com/). No alternatives afaik.


## YouTube Music and SoundCloud {#youtube-music-and-soundcloud}

This one is easy, nothing beats [NewPipe - a free YouTube client](https://newpipe.net/). The UI is a little bit clunckier then the YouTube app, but it lacks adds, and even more important, you can listen to music with your screen locked, eg, with your phone in your pocket, which is kind of the point of a mobile phone.

This app is the best app for Youtube, bar none. The only downside is that sometimes Google does something shady, and the app stops working. Then it's time to update. Not a big deal, but still, annoying.


## links {#links}

-   <https://njoseph.me/mediawiki/Privacy%5FStack>
-   [Personal F-Droid Repository • Gary Kim: Website](https://garykim.dev/blog/2020/04/14/personal-f-droid-repository/)
